tests/load-test.yml
```yaml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 10
scenarios:
  - flow:
    - get:
        url: '/tasks'
    - post:
        url: '/tasks'
        json:
          title: 'Load Test Task'
          description: 'Load Test Description'
          status: 'pending'
```